app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`name`, `email`, `title`, `content`, `created_at`, `updated_at`) VALUES ('muhammed', 'muhammed@gmail.com', 'ruby on rails', 'this is ruby on rails tutorial', '2017-06-20 19:18:34', '2017-06-20 19:18:34')

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE `posts` SET `name` = 'muhammed essa', `updated_at` = '2017-06-20 19:18:47' WHERE `posts`.`id` = 1